In [1]:
import numpy as np 
import pandas as pd

In [2]:
df = pd.read_csv("Data/Daily_Max_Vals.csv")

In [3]:
guage = df["gauge"].to_numpy()
day1 = guage[0::7]
day2 = guage[1::7]
day3 = guage[2::7]
day4 = guage[3::7]
day5 = guage[4::7]
day6 = guage[5::7]
day7 = guage[6::7]

In [4]:
len(day1) == len(day2) == len(day3) == len(day4) == len(day5) == len(day6) == len(day7)

False

In [5]:
print(len(day1))
print(len(day2))
print(len(day3))
print(len(day4))
print(len(day5))
print(len(day6))
print(len(day7))

783
783
783
782
782
782
782

In [6]:
df.tail(7)

,Unnamed: 0,date,stid,gauge,discharge,rainfall_inches,rainfall_ft
5470,5470,2022-10-16,RA101,2.96,83.5,0.00,0.00
5471,5471,2022-10-17,RA101,3.35,153.0,0.22,0.02
5472,5472,2022-10-18,RA101,3.35,153.0,0.00,0.00
5473,5473,2022-10-19,RA101,2.92,77.7,0.00,0.00
5474,5474,2022-10-20,RA101,2.85,68.1,0.00,0.00
5475,5475,2022-10-21,RA101,2.77,57.9,0.00,0.00
5476,5476,2022-10-22,RA101,2.72,52.0,0.00,0.00

In [7]:
df.head(7)

,Unnamed: 0,date,stid,gauge,discharge,rainfall_inches,rainfall_ft
0,0,2007-10-01,RA101,2.40,23.9,0.0,0.0
1,1,2007-10-02,RA101,2.39,23.2,0.0,0.0
2,2,2007-10-03,RA101,2.39,23.2,0.0,0.0
3,3,2007-10-04,RA101,2.39,23.2,0.0,0.0
4,4,2007-10-05,RA101,2.42,25.2,0.0,0.0
5,5,2007-10-06,RA101,2.43,25.9,0.0,0.0
6,6,2007-10-07,RA101,2.43,25.9,0.0,0.0

In [8]:
df = pd.read_csv("Data/Daily_Max_Vals.csv")

In [9]:
(len(df)-3)/7

782.0

In [10]:
df = df[3:len(df)]

In [11]:
df.head(1)

,Unnamed: 0,date,stid,gauge,discharge,rainfall_inches,rainfall_ft
3,3,2007-10-04,RA101,2.39,23.2,0.0,0.0

In [12]:
guage = df["gauge"].to_numpy()
day1 = guage[0::7]
day2 = guage[1::7]
day3 = guage[2::7]
day4 = guage[3::7]
day5 = guage[4::7]
day6 = guage[5::7]
day7 = guage[6::7]
len(day1) == len(day2) == len(day3) == len(day4) == len(day5) == len(day6) == len(day7)

True

In [13]:
print(len(day1))
print(len(day2))
print(len(day3))
print(len(day4))
print(len(day5))
print(len(day6))
print(len(day7))

782
782
782
782
782
782
782

In [14]:
rainfall = df["rainfall_ft"].to_numpy()[3:]
len(rainfall)/7 #to see if the length matches with the amount we have for our days

781.5714285714286

In [15]:
rainfall_ft_weekly_mean = []

In [16]:
for i in range(0,len(rainfall),7):
    rainfall_ft_weekly_mean.append((rainfall[i:i+6].sum())/7)

In [17]:
len(rainfall_ft_weekly_mean)

782

In [18]:
next_day_guage = day1[1:]
next_day_guage = np.append(next_day_guage, 0)
print(len(next_day_guage))

782

In [19]:
weekly_data = {
    "Day1" : day1,
    "Day2" : day2,
    "Day3" : day3,
    "Day4" : day4,
    "Day5" : day5,
    "Day6" : day6,
    "Day7" : day7,
    "rainfall_ft_mean" : rainfall_ft_weekly_mean,
    "next_day_guage" : next_day_guage
}

In [20]:
weekly_data = pd.DataFrame(weekly_data)
weekly_data.head()

   Day1  Day2  Day3  Day4  Day5  Day6  Day7  rainfall_ft_mean  next_day_guage
0  2.39  2.42  2.43  2.43  2.43  3.48  4.08          0.002857            3.02
1  3.02  2.86  2.69  2.72  2.69  2.67  2.64          0.002857            2.61
2  2.61  3.27  3.33  2.70  2.64  2.59  2.68          0.005714            3.07
3  3.07  3.36  6.56  4.43  3.49  3.18  3.01          0.000000            2.89
4  2.89  2.81  2.76  2.71  2.69  2.89  2.77          0.001429            2.66

In [21]:
weekly_data.to_csv('Data/Gauge_Windows.csv')